TexasInstruments/msp-hal_ti/mspm33/source/ti/driverlib/m33/dl_pka.h
/**
*
* @brief Gets the result of the comparison operation of two big numbers.
*
* This function provides the results of the comparison of two big numbers
* which was started using the DL_PKABigNumCmpStart().
*
* @param pka Pointer to the PKA register structure base address
*
* @return Returns a status code.
* - @ref PKA_STATUS_OPERATION_BUSY if the operation is in progress.
* - @ref PKA_STATUS_SUCCESS if the two big numbers are equal.
* - @ref PKA_STATUS_A_GREATER_THAN_B  if the first number is greater than the second.
* - @ref PKA_STATUS_A_LESS_THAN_B if the first number is less than the second.
*
* @sa DL_PKABigNumCmpStart()
*
*/
extern DL_PKA_Status DL_PKABigNumCmpGetResult(PKA_Regs* pka);

/**
*
* @brief Starts a big number inverse modulo operation.
*
* This function starts the inverse modulo operation on @c bigNum
* using the divisor @c modulus.
*
* @param pka Pointer to the PKA register structure base address
*
* @param [in] bigNum is the pointer to the buffer containing the big number
*        (dividend).
*
* @param [in] bigNumLength is the size of the @c bigNum in bytes.
*
* @param [in] modulus is the pointer to the buffer containing the divisor.
*
* @param [in] modulusLength is the size of the divisor in bytes.
*
* @param [out] resultPKAMemAddr is the pointer to the result vector location
*        which will be set by this function.
*
*
*@return Returns a status code.
* - @ref PKA_STATUS_SUCCESS if successful in starting the operation.
* - @ref PKA_STATUS_OPERATION_BUSY if the PKA module is busy doing
*        some other operation.
*
* @sa DL_PKABigNumInvModGetResult()
*
*/
extern DL_PKA_Status DL_PKABigNumInvModStart(PKA_Regs* pka,
    const uint8_t* bigNum, uint32_t bigNumLength, const uint8_t* modulus,
    uint32_t modulusLength, uint32_t* resultPKAMemAddr);

/**
*
* @brief Gets the result of the big number inverse modulo operation.
*
* This function gets the result of the big number inverse modulo operation
* previously started using the function DL_PKABigNumInvModStart().
* The function will zero-out @c resultBuf prior to copying in the result of
* the inverse modulo operation.
*
* @param pka Pointer to the PKA register structure base address
*
* @param [out] resultBuf is the pointer to buffer where the result needs to be
*        stored.
*
* @param [in] length is the size of the provided buffer in bytes.
*
* @param [in] resultPKAMemAddr is the address of the result location which
*        was provided by the start function DL_PKABigNumInvModStart().
*
* @return Returns a status code.
* - @ref PKA_STATUS_SUCCESS if the operation is successful.
* - @ref PKA_STATUS_OPERATION_BUSY if the PKA module is busy performing
*        the operation.
* - @ref PKA_STATUS_RESULT_0 if the result is all zeros.
* - @ref PKA_STATUS_BUF_UNDERFLOW if the length of the provided buffer is less
*        than the result.
*
* @sa DL_PKABigNumInvModStart()
*
*/
extern DL_PKA_Status DL_PKABigNumInvModGetResult(PKA_Regs* pka,
    uint8_t* resultBuf, uint32_t length, uint32_t resultPKAMemAddr);

/**
*
* @brief Starts a big number modular exponentiation operation.
*
* This function starts the exponentiation operation on @c base with
* @c exponent and modulo @c modulus.
*
* @param pka Pointer to the PKA register structure base address
*
* @param [in] base is the pointer to the buffer containing the big number
*             to exponentiate.
*
* @param [in] baseLength is the size of the @c base in bytes.
*
* @param [in] exponent is the pointer to the buffer containing the big number
*             that exponentiates.
*
* @param [in] exponentLength is the size of the @c exponent in bytes.

* @param [in] modulus is the pointer to the buffer containing the divisor.
*
* @param [in] modulusLength is the size of the divisor in bytes.
*
* @param [out] resultPKAMemAddr is the pointer to the result vector location
*        which will be set by this function.
*
*
*@return Returns a status code.
* - @ref PKA_STATUS_SUCCESS if successful in starting the operation.
* - @ref PKA_STATUS_OPERATION_BUSY if the PKA module is busy doing
*        some other operation.
*
* @sa DL_PKABigNumExpModGetResult()
*
*/
extern DL_PKA_Status DL_PKABigNumExpModStart(PKA_Regs* pka,
    const uint8_t* base, uint32_t baseLength, const uint8_t* exponent,
    uint32_t exponentLength, const uint8_t* modulus, uint32_t modulusLength,
    uint32_t* resultPKAMemAddr);

/**
*
* @brief Gets the result of the big number modular exponentiation operation.
*
* This function gets the result of the big number modular exponentiation
* operation previously started using the function DL_PKABigNumExpModStart().
* The function will zero-out @c resultBuf prior to copying in the result of
* the modular exponentiation operation.
*
* @param pka Pointer to the PKA register structure base address
*
* @param [out] resultBuf is the pointer to buffer where the result needs to be
*        stored.
*
* @param [in] length is the size of the provided buffer in bytes.
*
* @param [in] resultPKAMemAddr is the address of the result location which
*        was provided by the start function DL_PKABigNumExpModStart().
*
* @return Returns a status code.
* - @ref PKA_STATUS_SUCCESS if the operation is successful.
* - @ref PKA_STATUS_OPERATION_BUSY if the PKA module is busy performing
*        the operation.
* - @ref PKA_STATUS_RESULT_0 if the result is all zeros.
* - @ref PKA_STATUS_BUF_UNDERFLOW if the length of the provided buffer is less
*        than the result.
*
* @sa DL_PKABigNumExpModStart()
*
*/
extern DL_PKA_Status DL_PKABigNumExpModGetResult(PKA_Regs* pka,
    uint8_t* resultBuf, uint32_t length, uint32_t resultPKAMemAddr);

/**
*
* @brief Starts the multiplication of two big numbers.
*
* @param pka Pointer to the PKA register structure base address
*
* @param [in] multiplicand is the pointer to the buffer containing the big
*        number multiplicand.
*
* @param [in] multiplicandLength is the size of the multiplicand in bytes.
*
* @param [in] multiplier is the pointer to the buffer containing the big
*        number multiplier.
*
* @param [in] multiplierLength is the size of the multiplier in bytes.
*
* @param [out] resultPKAMemAddr is the pointer to the result vector location
*        which will be set by this function.
*
*@return Returns a status code.
* - @ref PKA_STATUS_SUCCESS if successful in starting the operation.
* - @ref PKA_STATUS_OPERATION_BUSY if the PKA module is busy doing
*        some other operation.
*
* @sa DL_PKABigNumMultGetResult()
*
*/
extern DL_PKA_Status DL_PKABigNumMultiplyStart(PKA_Regs* pka,
    const uint8_t* multiplicand, uint32_t multiplicandLength,
    const uint8_t* multiplier, uint32_t multiplierLength,
    uint32_t* resultPKAMemAddr);

/**
*
* @brief Gets the result of the big number multiplication.
*
* This function gets the result of the multiplication of two big numbers
* operation previously started using the function DL_PKABigNumMultiplyStart().
*
* @param pka Pointer to the PKA register structure base address
*
* @param [out] resultBuf is the pointer to buffer where the result needs to be
*        stored.
*
* @param [in, out] resultLength is the address of the variable containing the length of the
*        buffer in bytes. After the operation, the actual length of the resultant is stored
*        at this address.
*
* @param [in] resultPKAMemAddr is the address of the result location which
*        was provided by the start function DL_PKABigNumMultiplyStart().
*
* @return Returns a status code.
* - @ref PKA_STATUS_SUCCESS if the operation is successful.
* - @ref PKA_STATUS_OPERATION_BUSY if the PKA module is busy performing
*        the operation.
* - @ref PKA_STATUS_RESULT_0 if the result is all zeros.
* - @ref PKA_STATUS_FAILURE if the operation is not successful.
* - @ref PKA_STATUS_BUF_UNDERFLOW if the length of the provided buffer is less
*        then the length of the result.
*
* @sa DL_PKABigNumMultiplyStart()
*
*/
extern DL_PKA_Status DL_PKABigNumMultGetResult(PKA_Regs* pka,
    uint8_t* resultBuf, uint32_t* resultLength, uint32_t resultPKAMemAddr);

/**
*
* @brief Starts the addition of two big numbers.
*
* @param pka Pointer to the PKA register structure base address
*
* @param [in] bigNum1 is the pointer to the buffer containing the first
*        big number.
*
* @param [in] bigNum1Length is the size of the first big number in bytes.
*
* @param [in] bigNum2 is the pointer to the buffer containing the second
*        big number.
*
* @param [in] bigNum2Length is the size of the second big number in bytes.
*
* @param [out] resultPKAMemAddr is the pointer to the result vector location
*        which will be set by this function.
*
*@return Returns a status code.
* - @ref PKA_STATUS_SUCCESS if successful in starting the operation.
* - @ref PKA_STATUS_OPERATION_BUSY if the PKA module is busy doing
*        some other operation.
*
* @sa DL_PKABigNumAddGetResult()
*
*/
extern DL_PKA_Status DL_PKABigNumAddStart(PKA_Regs* pka,
    const uint8_t* bigNum1, uint32_t bigNum1Length, const uint8_t* bigNum2,
    uint32_t bigNum2Length, uint32_t* resultPKAMemAddr);

/**
*
* @brief Gets the result of the addition operation on two big numbers.
*
* @param pka Pointer to the PKA register structure base address
*
* @param [out] resultBuf is the pointer to buffer where the result
*        needs to be stored.
*
* @param [in, out] resultLength is the address of the variable containing
*        the length of the buffer.  After the operation the actual length of the
*        resultant is stored at this address.
*
* @param [in] resultPKAMemAddr is the address of the result location which
*        was provided by the start function DL_PKABigNumAddStart().
*
*
* @return Returns a status code.
* - @ref PKA_STATUS_SUCCESS if the operation is successful.
* - @ref PKA_STATUS_OPERATION_BUSY if the PKA module is busy performing
*        the operation.
* - @ref PKA_STATUS_RESULT_0 if the result is all zeros.
* - @ref PKA_STATUS_FAILURE if the operation is not successful.
* - @ref PKA_STATUS_BUF_UNDERFLOW if the length of the provided buffer is less
*        then the length of the result.
*
* @sa DL_PKABigNumAddStart()
*
*/
extern DL_PKA_Status DL_PKABigNumAddGetResult(PKA_Regs* pka,
    uint8_t* resultBuf, uint32_t* resultLength, uint32_t resultPKAMemAddr);

/**
*
* @brief Starts the subtraction of one big number from another.
*
* @param pka Pointer to the PKA register structure base address
*
* @param [in] minuend is the pointer to the buffer containing the big number
*             to be subtracted from.
*
* @param [in] minuendLength is the size of the minuend in bytes.
*
* @param [in] subtrahend is the pointer to the buffer containing the big
*             number to subtract from the @c minuend.
*
* @param [in] subtrahendLength is the size of the subtrahend in bytes.
*
* @param [out] resultPKAMemAddr is the pointer to the result vector location
*        which will be set by this function.
*
*@return Returns a status code.
* - @ref PKA_STATUS_SUCCESS if successful in starting the operation.
* - @ref PKA_STATUS_OPERATION_BUSY if the PKA module is busy doing
*        some other operation.
*
* @sa DL_PKABigNumSubGetResult()
*
*/
extern DL_PKA_Status DL_PKABigNumSubStart(PKA_Regs* pka,
    const uint8_t* minuend, uint32_t minuendLength, const uint8_t* subtrahend,
    uint32_t subtrahendLength, uint32_t* resultPKAMemAddr);

/**
*
* @brief Gets the result of the subtraction operation on two big numbers.
*
* @param pka Pointer to the PKA register structure base address
*
* @param [out] resultBuf is the pointer to buffer where the result
*        needs to be stored.
*
* @param [in, out] resultLength is the address of the variable containing
*        the length of the buffer.  After the operation the actual length of the
*        resultant is stored at this address.
*
* @param [in] resultPKAMemAddr is the address of the result location which
*        was provided by the start function DL_PKABigNumAddStart().
*
*
* @return Returns a status code.
* - @ref PKA_STATUS_SUCCESS if the operation is successful.
* - @ref PKA_STATUS_OPERATION_BUSY if the PKA module is busy performing
*        the operation.
* - @ref PKA_STATUS_RESULT_0 if the result is all zeros.
* - @ref PKA_STATUS_FAILURE if the operation is not successful.
* - @ref PKA_STATUS_BUF_UNDERFLOW if the length of the provided buffer is less
*        then the length of the result.
*
* @sa DL_PKABigNumSubStart()
*
*/
extern DL_PKA_Status DL_PKABigNumSubGetResult(PKA_Regs* pka,
    uint8_t* resultBuf, uint32_t* resultLength, uint32_t resultPKAMemAddr);

/**
*
* @brief Starts ECC multiplication.
*
* @param pka Pointer to the PKA register structure base address
*
* @param [in] scalar is pointer to the buffer containing the scalar
*        value to be multiplied.
*
* @param [in] curvePointX is the pointer to the buffer containing the
*        X coordinate of the elliptic curve point to be multiplied.
*        The point must be on the given curve.
*
* @param [in] curvePointY is the pointer to the buffer containing the
*        Y coordinate of the elliptic curve point to be multiplied.
*        The point must be on the given curve.
*
* @param [in] prime is the prime of the curve.
*
* @param [in] a is the a constant of the curve when the curve equation is expressed
*        in short Weierstrass form (y^3 = x^2 + a*x + b).
*
* @param [in] b is the b constant of the curve when the curve equation is expressed
*        in short Weierstrass form (y^3 = x^2 + a*x + b).
*
* @param [in] length is the length of the curve parameters in bytes.
*
* @param [out] resultPKAMemAddr is the pointer to the result vector location
*        which will be set by this function.
*
*@return Returns a status code.
* - @ref PKA_STATUS_SUCCESS if successful in starting the operation.
* - @ref PKA_STATUS_OPERATION_BUSY if the PKA module is busy doing
*        some other operation.
*
* @sa DL_PKAEccMultiplyGetResult()
*
*/
extern DL_PKA_Status DL_PKAEccMultiplyStart(PKA_Regs* pka,
    const uint8_t* scalar, const uint8_t* curvePointX,
    const uint8_t* curvePointY, const uint8_t* prime, const uint8_t* a,
    const uint8_t* b, uint32_t length, uint32_t* resultPKAMemAddr);

/**
*
* @brief Starts ECC Montgomery multiplication.
*
* @param pka Pointer to the PKA register structure base address
*
* @param [in] scalar is pointer to the buffer containing the scalar
*        value to be multiplied.
*
* @param [in] curvePointX is the pointer to the buffer containing the
*        X coordinate of the elliptic curve point to be multiplied.
*        The point must be on the given curve.
*
* @param [in] prime is the prime of the curve.
*
* @param [in] a is the a constant of the curve when the curve equation is expressed
*        in short Weierstrass form (y^3 = x^2 + a*x + b).
*
* @param [in] length is the length of the curve parameters in bytes.
*
* @param [out] resultPKAMemAddr is the pointer to the result vector location
*        which will be set by this function.
*
*@return Returns a status code.
* - @ref PKA_STATUS_SUCCESS if successful in starting the operation.
* - @ref PKA_STATUS_OPERATION_BUSY if the PKA module is busy doing
*        some other operation.
*
* @sa DL_PKAEccMultiplyGetResult()
*
*/
extern DL_PKA_Status DL_PKAEccMontgomeryMultiplyStart(PKA_Regs* pka,
    const uint8_t* scalar, const uint8_t* curvePointX, const uint8_t* prime,
    const uint8_t* a, uint32_t length, uint32_t* resultPKAMemAddr);

/**
*
* @brief Gets the result of ECC multiplication
*
* This function gets the result of ECC point multiplication operation on the
* EC point and the scalar value, previously started using the function
* DL_PKAEccMultiplyStart().
*
* @param pka Pointer to the PKA register structure base address
*
* @param [out] curvePointX is the pointer to the structure where the X coordinate
*         of the resultant EC point will be stored.
*
* @param [out] curvePointY is the pointer to the structure where the Y coordinate
*         of the resultant EC point will be stored.
*
* @param [in] resultPKAMemAddr is the address of the result location which
*        was provided by the start function DL_PKAEccMultiplyStart().
*
* @param [in] length is the length of the curve parameters in bytes.
*
* @return Returns a status code.
* - @ref PKA_STATUS_SUCCESS if the operation is successful.
* - @ref PKA_STATUS_OPERATION_BUSY if the PKA module is busy performing
*        the operation.
* - @ref PKA_STATUS_RESULT_0 if the result is all zeros.
* - @ref PKA_STATUS_FAILURE if the operation is not successful.
*
* @sa DL_PKAEccMultiplyStart()
*
*/
extern DL_PKA_Status DL_PKAEccMultiplyGetResult(PKA_Regs* pka,
    uint8_t* curvePointX, uint8_t* curvePointY, uint32_t resultPKAMemAddr,
    uint32_t length);

/**
*
* @brief Starts the ECC addition.
*
* @param pka Pointer to the PKA register structure base address
*
* @param [in] curvePoint1X is the pointer to the buffer containing the
*        X coordinate of the first elliptic curve point to be added.
*        The point must be on the given curve.
*
* @param [in] curvePoint1Y is the pointer to the buffer containing the
*        Y coordinate of the first elliptic curve point to be added.
*        The point must be on the given curve.
*
* @param [in] curvePoint2X is the pointer to the buffer containing the
*        X coordinate of the second elliptic curve point to be added.
*        The point must be on the given curve.
*
* @param [in] curvePoint2Y is the pointer to the buffer containing the
*        Y coordinate of the second elliptic curve point to be added.
*        The point must be on the given curve.
*
* @param [in] prime is the prime of the curve.
*
* @param [in] a is the a constant of the curve when the curve equation is expressed
*        in short Weierstrass form (y^3 = x^2 + a*x + b).
*
* @param [in] length is the length of the curve parameters in bytes.
*
* @param [out] resultPKAMemAddr is the pointer to the result vector location
*        which will be set by this function.
*
*@return Returns a status code.
* - @ref PKA_STATUS_SUCCESS if successful in starting the operation.
* - @ref PKA_STATUS_OPERATION_BUSY if the PKA module is busy doing
*        some other operation.
*
* @sa DL_PKAEccAddGetResult()
*
*/
extern DL_PKA_Status DL_PKAEccAddStart(PKA_Regs* pka,
    const uint8_t* curvePoint1X, const uint8_t* curvePoint1Y,
    const uint8_t* curvePoint2X, const uint8_t* curvePoint2Y,
    const uint8_t* prime, const uint8_t* a, const uint8_t* b, uint32_t length,
    uint32_t* resultPKAMemAddr);

/**
*
* @brief Gets the result of the ECC addition
*
* This function gets the result of ECC point addition operation on the
* on the two given EC points, previously started using the function
* DL_PKAEccAddStart().
*
* @param pka Pointer to the PKA register structure base address
*
* @param [out] curvePointX is the pointer to the structure where the X coordinate
*         of the resultant EC point will be stored.
*
* @param [out] curvePointY is the pointer to the structure where the Y coordinate
*         of the resultant EC point will be stored.
*
* @param [in] resultPKAMemAddr is the address of the result location which
*        was provided by the start function DL_PKAEccAddGetResult().
*
* @param [in] length is the length of the curve parameters in bytes.
*
* @return Returns a status code.
* - @ref PKA_STATUS_SUCCESS if the operation is successful.
* - @ref PKA_STATUS_OPERATION_BUSY if the PKA module is busy performing the operation.
* - @ref PKA_STATUS_RESULT_0 if the result is all zeros.
* - @ref PKA_STATUS_FAILURE if the operation is not successful.
*
* @sa DL_PKAEccAddStart()
*
*/
extern DL_PKA_Status DL_PKAEccAddGetResult(PKA_Regs* pka, uint8_t* curvePointX,
    uint8_t* curvePointY, uint32_t resultPKAMemAddr, uint32_t length);

/**
*
* @brief Begins the validation of a public key against a Short-Weierstrass curve
*
* This function validates a public key against a curve.
* After performing multiple smaller PKA operations in polling mode,
* it starts an ECC scalar multiplication.
*
* The function verifies that:
*  - X and Y are in the range [1, prime - 1]
*  - The point is not the point at infinity
*  - X and Y satisfy the Short-Weierstrass curve equation Y^2 = X^3 + a*X + b mod P
*  - Multiplying the point by the order of the curve yields the point at infinity
*
* @param pka Pointer to the PKA register structure base address
*
* @param [in] curvePointX is the pointer to the buffer containing the
*        X coordinate of the elliptic curve point to verify.
*
* @param [in] curvePointY is the pointer to the buffer containing the
*        Y coordinate of the elliptic curve point to verify.
*
* @param [in] prime is the prime of the curve.
*
* @param [in] a is the a constant of the curve when the curve equation is expressed
*        in Short-Weierstrass form (y^3 = x^2 + a*x + b).
*
* @param [in] b is the b constant of the curve when the curve equation is expressed
*        in Short-Weierstrass form (y^3 = x^2 + a*x + b).
*
* @param [in] order is the order of the curve.
*
* @param [in] length is the length of the curve parameters in bytes.
*
* @return Returns a status code.
* - @ref PKA_STATUS_SUCCESS if the operation is successful.
* - @ref PKA_STATUS_OPERATION_BUSY if the PKA module is busy performing the operation.
* - @ref PKA_STATUS_FAILURE if the operation is not successful.
* - @ref PKA_STATUS_X_ZERO if X is zero.
* - @ref PKA_STATUS_Y_ZERO if Y is zero.
* - @ref PKA_STATUS_X_LARGER_THAN_PRIME if X is larger than the curve prime
* - @ref PKA_STATUS_Y_LARGER_THAN_PRIME if Y is larger than the curve prime
* - @ref PKA_STATUS_POINT_NOT_ON_CURVE if X and Y do not satisfy the curve equation
*
* @sa PKAEccVerifyPublicKeyGetResult()
*
*/
extern DL_PKA_Status DL_PKAEccVerifyPublicKeyWeierstrassStart(PKA_Regs* pka,
    const uint8_t* curvePointX, const uint8_t* curvePointY,
    const uint8_t* prime, const uint8_t* a, const uint8_t* b,
    const uint8_t* order, uint32_t length);

/**
*
* @brief Assert reset to the PKA peripheral
*
* This function asserts a reset signal to the PKA peripheral by setting the
* RESETASSERT bit in the GPRCM.RSTCTL register. Writing a 1 to the RESETASSERT
* bit will trigger a reset of the peripheral.
*
* @param pka Pointer to the PKA register structure base address
*
* @return None
*
*/
extern void DL_PKA_resetAssert(PKA_Regs* pka);

/**
*
* @brief Clear the RESETSTKY bit in the STAT register
*
* This function clears the RESETSTKY bit in the STAT register by setting the
* RESETSTKYCLR bit in the GPRCM.RSTCTL register. Writing a 1 to the RESETSTKYCLR
* bit will clear the reset sticky bit.
*
* @param pka Pointer to the PKA register structure base address
*
* @return None
*
*/
extern void DL_PKA_resetStickyFlagClear(PKA_Regs* pka);

/**
*
* @brief Get the reset status from the STAT register
*
* This function reads the RESETSTKY bit in the STAT register to determine
* if the peripheral was reset since the bit was last cleared using
* DL_PKA_resetStickyFlagClear().
*
* @param pka Pointer to the PKA register structure base address
*
* @return Returns true if the peripheral was reset since the last bit clear,
*         false otherwise
*
*/
extern bool DL_PKA_getResetStatus(PKA_Regs* pka);
/**
*
* Mark the end of the C bindings section for C++ compilers.
*
*/
#ifdef __cplusplus
}
#endif

#endif
